# AssemblyInstanceId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..AssemblyInstanceId Property
Element Class See Also
---
The id of the assembly instance to which the element belongs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId AssemblyInstanceId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AssemblyInstanceId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ AssemblyInstanceId {
	ElementId^ get ();
}
```

# See Also
Element Class
Autodesk.Revit.DB Namespace